{
	"_meta": {
		"description": "Bem-vindo ao meu espaço digital! Sou o Léo, engenheiro de software apaixonado por criar soluções inovadoras e funcionais para desafios tecnológicos. Este é o meu cantinho na web, onde compartilho meu portfólio, experiências e insights sobre o mundo da programação e desenvolvimento de software.",
		"template": "Leonardo Lopes | %s",
		"title": "Leonardo Lopes | Engenheiro de Software Full Stack"
	},
	"about": {
		"_meta": {
			"description": "Conheça um pouco mais sobre mim, minhas experiências, habilidades e objetivos profissionais.",
			"title": "Sobre"
		},
		"button": "Entre em contato",
		"my_future": {
			"content": "Tenho grandes ambições e luto por elas todos os dias. Quero ser referência no que faço e ser conhecido na comunidade DEV, aspirando me tornar um GitHub Star um dia assim como meus ídolos. Além disso, tenho o sonho de trabalhar no exterior, seja remotamente ou presencialmente ja que uma das minhas maiores metas de vida é morar no Canadá.",
			"title": "MEU FUTURO"
		},
		"outside_work": {
			"content": "Nos raros momentos em que não estou mexendo com código, seja em projetos pessoais ou estudando, adoro assistir filmes, séries e animes. Faço exercícios todos os dias para manter o corpo e a mente saudáveis, passo ótimos momentos com meus amigos e mimo muito meu husky siberiano. E claro, jogo videogame sempre que posso!",
			"title": "E FORA DO CÓDIGO?"
		},
		"slug": "Vamos construir algo incrível juntos?",
		"subtitle": "Quem eu sou e o que faço",
		"title": "Um pouco sobre min",
		"what_i_do": {
			"content": "Desenvolvo soluções digitais escaláveis e performáticas, com experiência em desenvolvimento FrontEnd, Backend e Mobile, já desenvolvi diversos tipos de projetos, tanto de forma independente quanto em equipe. Minha experiência abrange desde Web3 e criptoativos até landing pages, blogs, sistemas de gestão, e-commerces, aplicativos de notícias e vendas, entre outros. Além disso, atuei várias vezes como líder em times de desenvolvimento, revisando código, arquitetando soluções e orientando os membros da minha equipe.",
			"title": "O QUE EU FAÇO"
		},
		"who_i_am": {
			"content": "E aí! Sou o Léo, engenheiro de software FullStack do interior de São Paulo e apaixonado por tecnologia. Tenho {age} anos de idade e <time></time> de experiência no mercado, além de estar cursando Análise e Desenvolvimento de Sistemas.",
			"title": "QUEM EU SOU"
		}
	},
	"footer": {
		"copy": "© {year} Leonardo Lopes. Todos os direitos reservados.",
		"external_links": {
			"email": "Email",
			"github": "GitHub",
			"instagram": "Instagram",
			"linkedin": "LinkedIn",
			"title": "Fora Daqui"
		},
		"gratings": "Obrigado por vir 😁",
		"links": {
			"about": "Sobre",
			"contact": "Contato",
			"experience": "Experiências",
			"home": "Home",
			"tech": "Tecnologias",
			"title": "Links"
		}
	},
	"header": {
		"about": "Sobre",
		"contact": "Contato",
		"experience": "Experiências",
		"home": "Home",
		"tech": "Tecnologias"
	},
	"home": {
		"about": {
			"me": {
				"subtitle": "Quem sou e o que faço",
				"title": "Sobre"
			},
			"tech": {
				"subtitle": "Ferramentas e linguagens que domino",
				"title": "Tecnologias"
			},
			"title": "Conheça-me"
		},
		"buttons": {
			"download_resume": "Veja meu currículo",
			"get_in_touch": "Entre em contato"
		},
		"contact": {
			"subtitle": "Gostaria de discutir a oportunidade de criar algo incrível juntos? estou pronto se você estiver.",
			"title": "Vamos trabalhar juntos?"
		},
		"description": "Engenheiro de Software Full Stack especializado em desenvolver soluções digitais escaláveis e performáticas. Com experiência em desenvolvimento frontend e backend, meu foco está na criação de aplicativos modernos para web e mobile.",
		"title": "Eu sou <break></break> <highlight>Leonardo Lopes</highlight>"
	},
	"technologies": {
		"_meta": {
			"description": "Conheça as tecnologias que domino e utilizo em meus projetos, desde linguagens de programação até frameworks e bibliotecas.",
			"title": "Tecnologias"
		},
		"cards": {
			"css": "CSS",
			"database": "Bancos de Dados",
			"framework": "Framework",
			"global-state": "Estado Global",
			"language": "Linguagem",
			"library": "Biblioteca",
			"mobile": "Mobile",
			"orm": "ORM",
			"runtime": "Runtime JS",
			"testing": "Teste",
			"tool": "Ferramenta",
			"validation": "Validação"
		},
		"databases": "Bancos de Dados",
		"frameworks": "Frameworks",
		"languages": "Linguagens",
		"libraries": "Bibliotecas",
		"subtitle": "Linguagens, frameworks, ferramentas e outras coisas que eu uso",
		"tests": "Testes",
		"title": "Tecnologias",
		"tools": "Ferramentas"
	},
	"experiences": {
		"_meta": {
			"description": "Conheça minha trajetória profissional, projetos e experiências que me tornaram o profissional que sou hoje.",
			"title": "Experiências"
		},
		"subtitle": "Minhas experiências profissionais até agora",
		"title": "Experiências",
		"buildbox-description": "Atuo no desenvolvimento, manutenção e aprimoramento de aplicativos, portais, sistemas e sites para os clientes da empresa. Responsável por garantir soluções tecnológicas eficientes e atualizadas, visando atender às necessidades específicas de cada cliente e promover uma experiência do usuário excepcional.",
		"nkey-description": "Desempenhei um papel crucial na concepção e desenvolvimento do sistema utilizado pela Poliedro Sistema de Ensino. Responsável por distribuir conteúdos, a plataforma atendeu mais de 580 unidades em todo o território brasileiro durante o meu envolvimento no projeto.",
		"genzys-description": "Encarregado do desenvolvimento dos websites de diversos produtos da empresa, todos centrados em tecnologia web3 e criptoativos. Desenvolvi interfaces envolventes e funcionais, garantindo uma presença online impactante para cada produto. Mantive-me atualizado com as últimas tendências em tecnologia blockchain, web3 e criptoativos, assegurando a integração eficaz desses elementos nos sites dos produtos.",
		"modu-description": "Desenvolvi de forma independente e do zero uma parte significativa do sistema atualmente utilizado pelo complexo Wanda Horta. Esta solução abrange a gestão de pacientes, funcionários, vendas e receitas. Meu trabalho incluiu a concepção, implementação e otimização do sistema para atender às necessidades específicas da instituição, demonstrando habilidades sólidas em desenvolvimento e solução de problemas.",
		"inceres-description": "Desenvolvi de forma independente e do zero uma parte significativa do sistema atualmente utilizado pelo complexo Wanda Horta. Esta solução abrange a gestão de pacientes, funcionários, vendas e receitas. Meu trabalho incluiu a concepção, implementação e otimização do sistema para atender às necessidades específicas da instituição, demonstrando habilidades sólidas em desenvolvimento e solução de problemas.",
		"primepass-description": "Desenvolvi e mantive interfaces no aplicativo PrimePass usando React Native. Contribuí para a experiência do usuário e a consistência visual, colaborando proativamente com a equipe. Mantive-me atualizado com as melhores práticas, otimizando o desempenho para garantir a qualidade do produto."
	}
}
